 const fs = require("fs");
module.exports.config = {
	name: "owner",
    version: "1.0.1",
	hasPermssion: 0,
	credits: "Arun", 
	description: "no prefix",
	commandCategory: "No command marks needed",
	usages: "...",
    cooldowns: 100, 
};

module.exports.handleEvent = function({ api, event, client, __GLOBAL }) {
	var { threadID, messageID } = event;
	let react = event.body.toLowerCase();
	if(react.includes("boss") ||
     react.includes("virat") || 
react.includes("owner")) {
		var msg = {
				body: "★𝗢𝘄𝗻𝗲𝗿 + ❤️...𝗗𝗝 𝗩𝗜𝗟𝗔𝗡 𝗧𝗔𝗕𝗛𝗔𝗜 ...❤️ ● ──────────────── ●𝐃𝐉 𝐕𝐈𝐋𝐀𝐍 𝐓𝐀𝐁𝐇𝐀𝐈 ● ──────────────── ●𝐎𝐰𝐧𝐞𝐫 ➻❤️....🅳︎🅹︎ 🆅︎🅸︎🅻︎🅰︎🅽︎ 🆃︎🅰︎🅱︎🅷︎🅰︎🅸︎....❤️★━━━━━━━━━━━━━━━━━‎━शायरी पर गौर फरमाए कृपया____________________________________________एक चोट दिल पर गहरी लगागए मानो मौत की सजा सुना गए  (___🥺❤️ यह सच है कि यह गम अब कभी भरेगा नहीं दिल चाह कर भी प्यार करेगा नहीं [~~~~~🥺😭 हां तेरे जाने से ये दुनिया दीवानी लगती है मेरे दास्तान सुनने वालों को फकत यह कहानी 🥺😭लगती है जख्म अब भी गहरा है ताज़ा है ताज़ा रहेगा हमसे देखने वालों को तो मेरी चोट भी पुरानी लगती है -!😭☹️💔★━━━━━━━━━━━━━━━━━‎━ शायरी [2]---- ऐसा कोई दिन वक्त पल नहीं जाता जिसमे तेरा मुझे ख्याल नहीं आता नींद से जैसे कोई दुश्मनी हो गई है सीने में सांसों की कोई कमी हो गई है!अब तुझे छूएगा कोई और यह सोचकर पाल-पाल मरता हूं नज्में लिखता हूं और रात भर पढ़ता रहता हूं ?!🥹🥲 शायरी [3]★━━━━━━━━━━━━━━━━━‎━  अगर मेरी यादों से तेरी कभी आजादी हो जाए अगर तेरी किसी और के साथ शादी हो जाए हो सके तो मुझे मेरे इश्क का दान देना अपने बेटे को मेरा नाम देना>>®÷🥺😭💔☹️ शायरी[ 4]★━━━━━━━━━━━━━━━━━‎━  उसकी दी हुई कुछ निशानी देखता हूं तू कर मैं तेरी नादानी देखता हूं ऐसा हकीम मिले तो बताना हम्हे जो कहे आओ मियां मैं हर परेशानी®?!😭💔🫰 देखता हूं(( शायरी [ 5] .★━━━━━━━━━━━━━━━━━‎━•♫•♬•एक बाजार लगा मोहब्बत सौदेबाजी जोरों से हुई =किसी को मिला खरीदार अच्छा अपनी यारी चोरों से हुई हमको हमी से चुराया उसने अपना करीबी खास यार बताया उसने लकीरें इन हाथों से फिसल गई वक्त बदला तो वह भी बदल गई जिस दिन अलग हुए मर जाऊंगी कहां करती थी  मोहब्बत नहीं हमारा गुस्सा भी सह करती थी परछाई बनकर साथ रहती थी दूर जाने से आंखों से बहती थी बो कोई माने या ना माने शादी तो आपसे ही होगी आरा यार कितना झूठ कहती थी बो |I{•------»※→→※→※→𒀱ꪳ꧁ 𝐈̊̊̊̊̊̊̊̊͢͢→※𝐌̤̝̝̝̝̽̽̽̽̽͜𝐈̈̈̈̈͢𝐒͋͋͋͋𝐒 𝐔̴̴̴̴̴̣̣̣̣͎͎͎̇̇̇̇̇̇̇ 𝗦͆͆͆͆͆͆͜͡𝗔̠̜̜̜̜̜̽̽̽𝗭͢𝗜͋̽͋𝗬𝗔̽͢˕̜᷾ 🩵 🪽 🩷😭",attachment: fs.createReadStream(__dirname + `/noprefix/hehehe.png`)
			}
			api.sendMessage(msg, threadID, messageID);
    api.setMessageReaction("🆗", event.messageID, (err) => {}, true)
		}
	}
	module.exports.run = function({ api, event, client, __GLOBAL }) {

	}
